Барбершоп/Catalogs/ДоговорКонтрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорКонтрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийНомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакБессрочногоДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Барбершоп/Catalogs/ДоговорКонтрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПризнакБесрочногоДоговораПриИзменении(Элемент)
	УстановитьВидимость()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено (Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
 Процедура УстановитьВидимость()  
	 
	Если Объект.ПризнакБессрочногоДоговора Тогда 

    Элементы.ДатаОкончанияДоговора.Видимость = Ложь;

    Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда 
        Объект.ДатаОкончанияДоговора = '0001,01,01';
    КонецЕсли;

Иначе

    Элементы.ДатаОкончанияДоговора.Видимость = Истина;

КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	Если ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора + " от " + Объект.ДатаЗаключенияДоговора;
	ИначеЕсли ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора;
	Иначе
		Объект.Наименование = "№ " + Объект.ДатаЗаключенияДоговора;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВнешнийНомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора()
КонецПроцедуры


&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора()
КонецПроцедуры
